Revit 2027 API
DWFExportOptions.ExportOnlyViewId Property
Only export the specified view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ExportOnlyViewId { get; set; }
Public Property ExportOnlyViewId As ElementId
	Get
	Set
public:
property ElementId^ ExportOnlyViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ExportOnlyViewId : ElementId with get, set
Property Value
ElementId
Remarks
Export only the specified view, but the data of the other views is still used, e. g. the hyperlink information.
See Also
Reference
DWFExportOptions Class
Autodesk.Revit.DB Namespace